# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']] 
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']] 
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4
  
  # [ch_out, block_type, block_nums, stage_num, act, variant]
  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']] 
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']] 
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']] 
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']] 

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  
  - [-1, 1, AIFI, [1024, 8]] 
  - [-1, 1, Conv, [256, 1, 1]]  

  - [-1, 1, SNI, [2]]
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [[-2, -1], 1, MFM, [256]]
  - [-1, 3, RepC3, [256, 0.5]] 
  - [-1, 1, Conv, [256, 1, 1]] 

  - [-1, 1, SNI, [2]] 
  - [4, 1, SPDConv, [128]] 
  - [[-1, -2, 5], 1, MFM, [256]] 
  - [-1, 1, CSPOmniKernel, []] 
  - [-1, 3, RepC3, [256, 0.5]]

  - [-1, 1, Conv, [256, 3, 2]] 
  - [[-1, 15], 1, MFM, [256]] 
  - [-1, 3, RepC3, [256, 0.5]] 

  - [-1, 1, Conv, [256, 3, 2]] 
  - [[-1, 10], 1, MFM, [256]] 
  - [-1, 3, RepC3, [256, 0.5]] 

  - [[20, 23, 26], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  